CsBoBoNice/STM32F10X_CsBoBo_Lib/CsBoBo_STM32F10X_catch.c
#include "CsBoBo_STM32F10X_catch.h"
//#define TIM2_IRQHandler_ENABLE
//#define TIM3_IRQHandler_ENABLE
//#define TIM4_IRQHandler_ENABLE
//#define TIM5_IRQHandler_ENABLE

/******使用方法******************************************************************/
/*
(默认：捕获低电平时间)

(注意：使用前将对应的中断打开，只需将上面对应的中断使能(#define TIM2_IRQHandler_ENABLE)//注释去掉即可)

@例:	Get_catch(5,1);	//函数返回值为捕获低电平时间
		参数1：选用定时器 取值范围（2,3,4,5）
									2	TIM2
									3	TIM3
									4	TIM4
									5	TIM5
		参数2：定时器通道(范围 1,2,3,4,)


@例:	TIM_Catch_Init(5,1,0,0,3);	//初始化输入捕获
		参数1：选用定时器 取值范围（2,3,4,5）
									2	TIM2
									3	TIM3
									4	TIM4
									5	TIM5
		参数2：定时器通道(范围 1,2,3,4,)
		参数3：是否重映射
		参数4：对应抢断优先级级别		取值范围(0,1,2,3)	数值越低优先级越高
		参数5：对应响应优先级级别		取值范围(0,1,2,3)	数值越低优先级越高

定时器	引脚重映像		通道	1	  2	   3	4

TIM2	0 没重映相				PA0   PA1  PA2   PA3 
		1 部分重映相1			PA15  PB3  PA2	 PA3
		2 部分重映像2			PA0   PA1  PB10	 PB11
		3 完全从映像			PA15  PB3  PB10  PB11

TIM3	0 没重映相				PA6   PA7  PB0   PB1
		1 部分重映像			PB4   PB5  PB0   PB1
		2 完全重映像			PC6   PC7  PC8   PC9

TIM4	0 没重映像				PB6   PB7  PB8   PB9
		1 完全重映像			PD12  PD13 PD14  PD15

TIM5    0 没重映像				PA0   PA1  PA2   PA3

*/
/********************************************************************************/

uint8_t  TIM2CH1_CAPTURE_STA=0;	//输入捕获状态		    				
uint16_t	TIM2CH1_CAPTURE_VAL;	//输入捕获值

uint8_t  TIM2CH2_CAPTURE_STA=0;	//输入捕获状态		    				
uint16_t	TIM2CH2_CAPTURE_VAL;	//输入捕获值

uint8_t  TIM2CH3_CAPTURE_STA=0;	//输入捕获状态		    				
uint16_t	TIM2CH3_CAPTURE_VAL;	//输入捕获值

uint8_t  TIM2CH4_CAPTURE_STA=0;	//输入捕获状态		    				
uint16_t	TIM2CH4_CAPTURE_VAL;	//输入捕获值

uint8_t  TIM3CH1_CAPTURE_STA=0;	//输入捕获状态		    				
uint16_t	TIM3CH1_CAPTURE_VAL;	//输入捕获值

uint8_t  TIM3CH2_CAPTURE_STA=0;	//输入捕获状态		    				
uint16_t	TIM3CH2_CAPTURE_VAL;	//输入捕获值

uint8_t  TIM3CH3_CAPTURE_STA=0;	//输入捕获状态		    				
uint16_t	TIM3CH3_CAPTURE_VAL;	//输入捕获值

uint8_t  TIM3CH4_CAPTURE_STA=0;	//输入捕获状态		    				
uint16_t	TIM3CH4_CAPTURE_VAL;	//输入捕获值

uint8_t  TIM4CH1_CAPTURE_STA=0;	//输入捕获状态		    				
uint16_t	TIM4CH1_CAPTURE_VAL;	//输入捕获值

uint8_t  TIM4CH2_CAPTURE_STA=0;	//输入捕获状态		    				
uint16_t	TIM4CH2_CAPTURE_VAL;	//输入捕获值

uint8_t  TIM4CH3_CAPTURE_STA=0;	//输入捕获状态		    				
uint16_t	TIM4CH3_CAPTURE_VAL;	//输入捕获值

uint8_t  TIM4CH4_CAPTURE_STA=0;	//输入捕获状态		    				
uint16_t	TIM4CH4_CAPTURE_VAL;	//输入捕获值

uint8_t  TIM5CH1_CAPTURE_STA=0;	//输入捕获状态		    				
uint16_t	TIM5CH1_CAPTURE_VAL;	//输入捕获值

uint8_t  TIM5CH2_CAPTURE_STA=0;	//输入捕获状态		    				
uint16_t	TIM5CH2_CAPTURE_VAL;	//输入捕获值

uint8_t  TIM5CH3_CAPTURE_STA=0;	//输入捕获状态		    				
uint16_t	TIM5CH3_CAPTURE_VAL;	//输入捕获值

uint8_t  TIM5CH4_CAPTURE_STA=0;	//输入捕获状态		    				
uint16_t	TIM5CH4_CAPTURE_VAL;	//输入捕获值

uint32_t Get_catch(u8 TIM,u16 TIM_channel)
{
	uint32_t temp=0;
	if(TIM==2)
	{
		switch(TIM_channel)
		{
			case 1:	if(TIM2CH1_CAPTURE_STA&0X80)//成功捕获到了一次上升沿
					{
						temp=TIM2CH1_CAPTURE_STA&0X3F;
						temp*=65536;//溢出时间总和
						temp+=TIM2CH1_CAPTURE_VAL;//得到总的低电平时间
						TIM2CH1_CAPTURE_STA=0;//开启下一次捕获
					}break;
			case 2:	if(TIM2CH2_CAPTURE_STA&0X80)//成功捕获到了一次上升沿
					{
						temp=TIM2CH2_CAPTURE_STA&0X3F;
						temp*=65536;//溢出时间总和
						temp+=TIM2CH2_CAPTURE_VAL;//得到总的低电平时间
						TIM2CH2_CAPTURE_STA=0;//开启下一次捕获
					}break;
			case 3:	if(TIM2CH3_CAPTURE_STA&0X80)//成功捕获到了一次上升沿
					{
						temp=TIM2CH3_CAPTURE_STA&0X3F;
						temp*=65536;//溢出时间总和
						temp+=TIM2CH4_CAPTURE_VAL;//得到总的低电平时间
						TIM2CH4_CAPTURE_STA=0;//开启下一次捕获
					}break;
			case 4:	if(TIM2CH4_CAPTURE_STA&0X80)//成功捕获到了一次上升沿
					{
						temp=TIM2CH4_CAPTURE_STA&0X3F;
						temp*=65536;//溢出时间总和
						temp+=TIM2CH4_CAPTURE_VAL;//得到总的低电平时间
						TIM2CH4_CAPTURE_STA=0;//开启下一次捕获
					}break;
		}
	}

	if(TIM==3)
	{
		switch(TIM_channel)
		{
			case 1:	if(TIM3CH1_CAPTURE_STA&0X80)//成功捕获到了一次上升沿
					{
						temp=TIM3CH1_CAPTURE_STA&0X3F;
						temp*=65536;//溢出时间总和
						temp+=TIM3CH1_CAPTURE_VAL;//得到总的低电平时间
						TIM3CH1_CAPTURE_STA=0;//开启下一次捕获
					}break;
			case 2:	if(TIM3CH2_CAPTURE_STA&0X80)//成功捕获到了一次上升沿
					{
						temp=TIM3CH2_CAPTURE_STA&0X3F;
						temp*=65536;//溢出时间总和
						temp+=TIM3CH2_CAPTURE_VAL;//得到总的低电平时间
						TIM3CH2_CAPTURE_STA=0;//开启下一次捕获
					}break;
			case 3:	if(TIM3CH3_CAPTURE_STA&0X80)//成功捕获到了一次上升沿
					{
						temp=TIM3CH3_CAPTURE_STA&0X3F;
						temp*=65536;//溢出时间总和
						temp+=TIM3CH4_CAPTURE_VAL;//得到总的低电平时间
						TIM3CH4_CAPTURE_STA=0;//开启下一次捕获
					}break;
			case 4:	if(TIM3CH4_CAPTURE_STA&0X80)//成功捕获到了一次上升沿
					{
						temp=TIM3CH4_CAPTURE_STA&0X3F;
						temp*=65536;//溢出时间总和
						temp+=TIM3CH4_CAPTURE_VAL;//得到总的低电平时间
						TIM3CH4_CAPTURE_STA=0;//开启下一次捕获
					}break;
		}
	}

	if(TIM==4)
	{
		switch(TIM_channel)
		{
			case 1:	if(TIM4CH1_CAPTURE_STA&0X80)//成功捕获到了一次上升沿
					{
						temp=TIM4CH1_CAPTURE_STA&0X3F;
						temp*=65536;//溢出时间总和
						temp+=TIM4CH1_CAPTURE_VAL;//得到总的低电平时间
						TIM4CH1_CAPTURE_STA=0;//开启下一次捕获
					}break;
			case 2:	if(TIM4CH2_CAPTURE_STA&0X80)//成功捕获到了一次上升沿
					{
						temp=TIM4CH2_CAPTURE_STA&0X3F;
						temp*=65536;//溢出时间总和
						temp+=TIM4CH2_CAPTURE_VAL;//得到总的低电平时间
						TIM4CH2_CAPTURE_STA=0;//开启下一次捕获
					}break;
			case 3:	if(TIM4CH3_CAPTURE_STA&0X80)//成功捕获到了一次上升沿
					{
						temp=TIM4CH3_CAPTURE_STA&0X3F;
						temp*=65536;//溢出时间总和
						temp+=TIM4CH4_CAPTURE_VAL;//得到总的低电平时间
						TIM4CH4_CAPTURE_STA=0;//开启下一次捕获
					}break;
			case 4:	if(TIM4CH4_CAPTURE_STA&0X80)//成功捕获到了一次上升沿
					{
						temp=TIM4CH4_CAPTURE_STA&0X3F;
						temp*=65536;//溢出时间总和
						temp+=TIM4CH4_CAPTURE_VAL;//得到总的低电平时间
						TIM4CH4_CAPTURE_STA=0;//开启下一次捕获
					}break;
		}
	}

	if(TIM==5)
	{
		switch(TIM_channel)
		{
			case 1:	if(TIM5CH1_CAPTURE_STA&0X80)//成功捕获到了一次上升沿
					{
						temp=TIM5CH1_CAPTURE_STA&0X3F;
						temp*=65536;//溢出时间总和
						temp+=TIM5CH1_CAPTURE_VAL;//得到总的低电平时间
						TIM5CH1_CAPTURE_STA=0;//开启下一次捕获
					}break;
			case 2:	if(TIM5CH2_CAPTURE_STA&0X80)//成功捕获到了一次上升沿
					{
						temp=TIM5CH2_CAPTURE_STA&0X3F;
						temp*=65536;//溢出时间总和
						temp+=TIM5CH2_CAPTURE_VAL;//得到总的低电平时间
						TIM5CH2_CAPTURE_STA=0;//开启下一次捕获
					}break;
			case 3:	if(TIM5CH3_CAPTURE_STA&0X80)//成功捕获到了一次上升沿
					{
						temp=TIM5CH3_CAPTURE_STA&0X3F;
						temp*=65536;//溢出时间总和
						temp+=TIM5CH3_CAPTURE_VAL;//得到总的低电平时间
						TIM5CH3_CAPTURE_STA=0;//开启下一次捕获
					}break;
			case 4:	if(TIM5CH4_CAPTURE_STA&0X80)//成功捕获到了一次上升沿
					{
						temp=TIM5CH4_CAPTURE_STA&0X3F;
						temp*=65536;//溢出时间总和
						temp+=TIM5CH4_CAPTURE_VAL;//得到总的低电平时间
						TIM5CH4_CAPTURE_STA=0;//开启下一次捕获
					}break;
		}
	}
	return temp;
}


#ifdef TIM2_IRQHandler_ENABLE
void TIM2_IRQHandler(void)
{
	if((TIM2CH1_CAPTURE_STA&0X80)==0)//还未成功捕获	
	{	  
		if (TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET)	//TIM_IT_Update TIM 中断源
		 
		{	    
			if(TIM2CH1_CAPTURE_STA&0X40)//已经捕获到低电平了
			{
				if((TIM2CH1_CAPTURE_STA&0X3F)==0X3F)//低电平太长了
				{
					TIM2CH1_CAPTURE_STA|=0X80;//标记成功捕获了一次
					TIM2CH1_CAPTURE_VAL=0XFFFF;
				}else TIM2CH1_CAPTURE_STA++;
			}	 
		}
		if (TIM_GetITStatus(TIM2, TIM_IT_CC1) != RESET)//捕获1发生捕获事件	检查指定的 TIM 中断发生与否
		{	
			if(TIM2CH1_CAPTURE_STA&0X40)		//捕获到一个上升沿 		
			{	  			
				TIM2CH1_CAPTURE_STA|=0X80;		//标记成功捕获到一次低电平脉宽
				TIM2CH1_CAPTURE_VAL=TIM_GetCapture1(TIM2);//获得 TIMx 输入捕获 1 的值
		   		TIM_OC1PolarityConfig(TIM2,TIM_ICPolarity_Falling); //CC1P=0 设置为下降沿捕获
																	//设置 TIMx 通道 1 极性
			}else  								//还未开始,第一次捕获上升沿
			{
				TIM2CH1_CAPTURE_STA=0;			//清空
				TIM2CH1_CAPTURE_VAL=0;
	 			TIM_SetCounter(TIM2,0);//设置 TIMx 计数器寄存器值
				TIM2CH1_CAPTURE_STA|=0X40;		//标记捕获到了上升沿
		   		TIM_OC1PolarityConfig(TIM2,TIM_ICPolarity_Rising);		//CC1P=1 设置为上升沿捕获
															/*TIM_ICPolarity_Rising TIM 输入捕获上升沿
																TIM_ICPolarity_Falling TIM 输入捕获下降沿			
															*/
			}		    
		}			     	    					   
 	}

	if((TIM2CH2_CAPTURE_STA&0X80)==0)//还未成功捕获	
	{	  
		if (TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET)	//TIM_IT_Update TIM 中断源
		 
		{	    
			if(TIM2CH2_CAPTURE_STA&0X40)//已经捕获到低电平了
			{
				if((TIM2CH2_CAPTURE_STA&0X3F)==0X3F)//低电平太长了
				{
					TIM2CH2_CAPTURE_STA|=0X80;//标记成功捕获了一次
					TIM2CH2_CAPTURE_VAL=0XFFFF;
				}else TIM2CH2_CAPTURE_STA++;
			}	 
		}
		if (TIM_GetITStatus(TIM2, TIM_IT_CC2) != RESET)//捕获2发生捕获事件	检查指定的 TIM 中断发生与否
		{	
			if(TIM2CH2_CAPTURE_STA&0X40)		//捕获到一个上升沿 		
			{	  			
				TIM2CH2_CAPTURE_STA|=0X80;		//标记成功捕获到一次低电平脉宽
				TIM2CH2_CAPTURE_VAL=TIM_GetCapture2(TIM2);//获得 TIMx 输入捕获 2 的值
		   		TIM_OC2PolarityConfig(TIM2,TIM_ICPolarity_Falling); //CC2P=0 设置为下降沿捕获
																	//设置 TIMx 通道 2 极性
			}else  								//还未开始,第一次捕获上升沿
			{
				TIM2CH2_CAPTURE_STA=0;			//清空
				TIM2CH2_CAPTURE_VAL=0;
	 			TIM_SetCounter(TIM2,0);//设置 TIMx 计数器寄存器值
				TIM2CH2_CAPTURE_STA|=0X40;		//标记捕获到了上升沿
		   		TIM_OC2PolarityConfig(TIM2,TIM_ICPolarity_Rising);		//CC2P=1 设置为上升沿捕获
															/*TIM_ICPolarity_Rising TIM 输入捕获上升沿
																TIM_ICPolarity_Falling TIM 输入捕获下降沿			
															*/
			}		    
		}			     	    					   
 	}

