CsBoBoNice/STM32F10X_CsBoBo_Lib/CsBoBo_STM32F10X_catch.c
	if((TIM5CH3_CAPTURE_STA&0X80)==0)//还未成功捕获	
	{	  
		if (TIM_GetITStatus(TIM5, TIM_IT_Update) != RESET)	//TIM_IT_Update TIM 中断源
		 
		{	    
			if(TIM5CH3_CAPTURE_STA&0X40)//已经捕获到低电平了
			{
				if((TIM5CH3_CAPTURE_STA&0X3F)==0X3F)//低电平太长了
				{
					TIM5CH3_CAPTURE_STA|=0X80;//标记成功捕获了一次
					TIM5CH3_CAPTURE_VAL=0XFFFF;
				}else TIM5CH3_CAPTURE_STA++;
			}	 
		}
		if (TIM_GetITStatus(TIM5, TIM_IT_CC3) != RESET)//捕获3发生捕获事件	检查指定的 TIM 中断发生与否
		{	
			if(TIM5CH3_CAPTURE_STA&0X40)		//捕获到一个上升沿 		
			{	  			
				TIM5CH3_CAPTURE_STA|=0X80;		//标记成功捕获到一次低电平脉宽
				TIM5CH3_CAPTURE_VAL=TIM_GetCapture3(TIM5);//获得 TIMx 输入捕获 3 的值
		   		TIM_OC3PolarityConfig(TIM5,TIM_ICPolarity_Falling); //CC3P=0 设置为下降沿捕获
																	//设置 TIMx 通道 3 极性
			}else  								//还未开始,第一次捕获上升沿
			{
				TIM5CH3_CAPTURE_STA=0;			//清空
				TIM5CH3_CAPTURE_VAL=0;
	 			TIM_SetCounter(TIM5,0);//设置 TIMx 计数器寄存器值
				TIM5CH3_CAPTURE_STA|=0X40;		//标记捕获到了上升沿
		   		TIM_OC3PolarityConfig(TIM5,TIM_ICPolarity_Rising);		//CC3P=1 设置为上升沿捕获
															/*TIM_ICPolarity_Rising TIM 输入捕获上升沿
																TIM_ICPolarity_Falling TIM 输入捕获下降沿			
															*/
			}		    
		}			     	    					   
 	}

	if((TIM5CH4_CAPTURE_STA&0X80)==0)//还未成功捕获	
	{	  
		if (TIM_GetITStatus(TIM5, TIM_IT_Update) != RESET)	//TIM_IT_Update TIM 中断源
		 
		{	    
			if(TIM5CH4_CAPTURE_STA&0X40)//已经捕获到低电平了
			{
				if((TIM5CH4_CAPTURE_STA&0X3F)==0X3F)//低电平太长了
				{
					TIM5CH4_CAPTURE_STA|=0X80;//标记成功捕获了一次
					TIM5CH4_CAPTURE_VAL=0XFFFF;
				}else TIM5CH4_CAPTURE_STA++;
			}	 
		}
		if (TIM_GetITStatus(TIM5, TIM_IT_CC4) != RESET)//捕获4发生捕获事件	检查指定的 TIM 中断发生与否
		{	
			if(TIM5CH4_CAPTURE_STA&0X40)		//捕获到一个上升沿 		
			{	  			
				TIM5CH4_CAPTURE_STA|=0X80;		//标记成功捕获到一次低电平脉宽
				TIM5CH4_CAPTURE_VAL=TIM_GetCapture4(TIM5);//获得 TIMx 输入捕获 4 的值
		   		TIM_OC4PolarityConfig(TIM5,TIM_ICPolarity_Falling); //CC4P=0 设置为下降沿捕获
																	//设置 TIMx 通道 4 极性
			}else  								//还未开始,第一次捕获上升沿
			{
				TIM5CH4_CAPTURE_STA=0;			//清空
				TIM5CH4_CAPTURE_VAL=0;
	 			TIM_SetCounter(TIM5,0);//设置 TIMx 计数器寄存器值
				TIM5CH4_CAPTURE_STA|=0X40;		//标记捕获到了上升沿
		   		TIM_OC4PolarityConfig(TIM5,TIM_ICPolarity_Rising);		//CC4P=1 设置为上升沿捕获
															/*TIM_ICPolarity_Rising TIM 输入捕获上升沿
																TIM_ICPolarity_Falling TIM 输入捕获下降沿			
															*/
			}		    
		}			     	    					   
 	}

    TIM_ClearITPendingBit(TIM5, TIM_IT_CC1|TIM_IT_CC2|TIM_IT_CC3|TIM_IT_CC4|TIM_IT_Update); //清除中断标志位
}
#endif /* TIM5_IRQHandler_ENABLE */


void TIM2_CATCH_GPIO_Init(u16 TIM_channel,u8 remap_pwm)
{
	GPIO_InitTypeDef GPIO_InitStruct;
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2,ENABLE);
	if(remap_pwm==0)
	{
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
		GPIO_InitStruct.GPIO_Mode=GPIO_Mode_IPU;
		GPIO_InitStruct.GPIO_Speed=GPIO_Speed_50MHz;
		
		switch(TIM_channel)
		{
				case 1:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_0;
						GPIO_Init(GPIOA,&GPIO_InitStruct);break;
				case 2:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_1;
						GPIO_Init(GPIOA,&GPIO_InitStruct);break;
				case 3:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_2;
						GPIO_Init(GPIOA,&GPIO_InitStruct);break;
				case 4:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_3;
						GPIO_Init(GPIOA,&GPIO_InitStruct);break;	
		}
	}

	if(remap_pwm==1)
	{
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA|RCC_APB2Periph_GPIOB|RCC_APB2Periph_AFIO,ENABLE);
		GPIO_PinRemapConfig(GPIO_PartialRemap1_TIM2, ENABLE); //TIM2 复用功能部分映射1
		GPIO_InitStruct.GPIO_Mode=GPIO_Mode_IPU;
		GPIO_InitStruct.GPIO_Speed=GPIO_Speed_50MHz;
		switch(TIM_channel)
		{
				case 1:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_15;
						GPIO_Init(GPIOA,&GPIO_InitStruct);break;
				case 2:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_3;
						GPIO_Init(GPIOB,&GPIO_InitStruct);break;
				case 3:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_2;
						GPIO_Init(GPIOA,&GPIO_InitStruct);break;
				case 4:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_3;
						GPIO_Init(GPIOA,&GPIO_InitStruct);break;	
		}		
	}
	
	if(remap_pwm==2)
	{
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA|RCC_APB2Periph_GPIOB|RCC_APB2Periph_AFIO,ENABLE);
		GPIO_PinRemapConfig(GPIO_PartialRemap2_TIM2, ENABLE); //TIM2 复用功能部分映射2
		GPIO_InitStruct.GPIO_Mode=GPIO_Mode_IPU;
		GPIO_InitStruct.GPIO_Speed=GPIO_Speed_50MHz;
		switch(TIM_channel)
		{
				case 1:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_0;
						GPIO_Init(GPIOA,&GPIO_InitStruct);break;
				case 2:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_1;
						GPIO_Init(GPIOA,&GPIO_InitStruct);break;
				case 3:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_10;
						GPIO_Init(GPIOB,&GPIO_InitStruct);break;
				case 4:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_11;
						GPIO_Init(GPIOB,&GPIO_InitStruct);break;	
		}		
	}

	if(remap_pwm==3)
	{
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA|RCC_APB2Periph_GPIOB|RCC_APB2Periph_AFIO,ENABLE);
		GPIO_PinRemapConfig(GPIO_FullRemap_TIM2, ENABLE); //TIM2 复用功能完全映射
		GPIO_InitStruct.GPIO_Mode=GPIO_Mode_IPU;
		GPIO_InitStruct.GPIO_Speed=GPIO_Speed_50MHz;
		switch(TIM_channel)
		{
				case 1:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_15;
						GPIO_Init(GPIOA,&GPIO_InitStruct);break;
				case 2:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_3;
						GPIO_Init(GPIOB,&GPIO_InitStruct);break;
				case 3:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_10;
						GPIO_Init(GPIOB,&GPIO_InitStruct);break;
				case 4:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_11;
						GPIO_Init(GPIOB,&GPIO_InitStruct);break;	
		}		
	}	
}
void TIM3_CATCH_GPIO_Init(u16 TIM_channel,u8 remap_pwm)
{
	GPIO_InitTypeDef GPIO_InitStruct;
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3,ENABLE);
	if(remap_pwm==0)
	{
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA|RCC_APB2Periph_GPIOB,ENABLE);
		GPIO_InitStruct.GPIO_Mode=GPIO_Mode_IPU;		
		GPIO_InitStruct.GPIO_Speed=GPIO_Speed_50MHz;		
		switch(TIM_channel)
		{
				case 1:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_6;
						GPIO_Init(GPIOA,&GPIO_InitStruct);break;
				case 2:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_7;
						GPIO_Init(GPIOA,&GPIO_InitStruct);break;
				case 3:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_0;
						GPIO_Init(GPIOB,&GPIO_InitStruct);break;
				case 4:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_1;
						GPIO_Init(GPIOB,&GPIO_InitStruct);break;	
		}
	}

	if(remap_pwm==1)
	{
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
		GPIO_PinRemapConfig(GPIO_PartialRemap_TIM3, ENABLE); //TIM3 复用功能部分映射
		GPIO_InitStruct.GPIO_Mode=GPIO_Mode_IPU;		
		GPIO_InitStruct.GPIO_Speed=GPIO_Speed_50MHz;
		switch(TIM_channel)
		{
				case 1:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_4;
						GPIO_Init(GPIOB,&GPIO_InitStruct);break;
				case 2:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_5;
						GPIO_Init(GPIOB,&GPIO_InitStruct);break;
				case 3:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_0;
						GPIO_Init(GPIOB,&GPIO_InitStruct);break;
				case 4:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_1;
						GPIO_Init(GPIOB,&GPIO_InitStruct);break;	
		}		
	}
	
	if(remap_pwm==2)
	{
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC|RCC_APB2Periph_AFIO,ENABLE);
		GPIO_PinRemapConfig(GPIO_FullRemap_TIM3, ENABLE); //TIM3 复用功能完全映射
		GPIO_InitStruct.GPIO_Mode=GPIO_Mode_IPU;		
		GPIO_InitStruct.GPIO_Speed=GPIO_Speed_50MHz;
		switch(TIM_channel)
		{
				case 1:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_6;
						GPIO_Init(GPIOC,&GPIO_InitStruct);break;
				case 2:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_7;
						GPIO_Init(GPIOC,&GPIO_InitStruct);break;
				case 3:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_8;
						GPIO_Init(GPIOC,&GPIO_InitStruct);break;
				case 4:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_9;
						GPIO_Init(GPIOC,&GPIO_InitStruct);break;	
		}
	}
}
void TIM4_CATCH_GPIO_Init(u16 TIM_channel,u8 remap_pwm)
{
	GPIO_InitTypeDef GPIO_InitStruct;
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4,ENABLE);
	if(remap_pwm==0)
	{
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
		GPIO_InitStruct.GPIO_Mode=GPIO_Mode_IPU;
		GPIO_InitStruct.GPIO_Speed=GPIO_Speed_50MHz;		
		switch(TIM_channel)
		{
			case 1:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_6;
					GPIO_Init(GPIOB,&GPIO_InitStruct);break;
			case 2:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_7;
					GPIO_Init(GPIOB,&GPIO_InitStruct);break;
			case 3:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_8;
					GPIO_Init(GPIOB,&GPIO_InitStruct);break;
			case 4:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_9;
					GPIO_Init(GPIOB,&GPIO_InitStruct);break;	
		}		
	}

	if(remap_pwm==1)
	{
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD|RCC_APB2Periph_AFIO,ENABLE);
		GPIO_PinRemapConfig(GPIO_Remap_TIM4, ENABLE); //TIM4 复用功能映射
		GPIO_InitStruct.GPIO_Mode=GPIO_Mode_IPU;
		GPIO_InitStruct.GPIO_Speed=GPIO_Speed_50MHz;		
		switch(TIM_channel)
		{
			case 1:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_12;
					GPIO_Init(GPIOD,&GPIO_InitStruct);break;
			case 2:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_13;
					GPIO_Init(GPIOD,&GPIO_InitStruct);break;
			case 3:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_14;
					GPIO_Init(GPIOD,&GPIO_InitStruct);break;
			case 4:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_15;
					GPIO_Init(GPIOD,&GPIO_InitStruct);break;	
		}		
	}
}
void TIM5_CATCH_GPIO_Init(u16 TIM_channel,u8 remap_pwm)
{
	GPIO_InitTypeDef GPIO_InitStruct;
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM5,ENABLE);		//使能TIM5
	if(remap_pwm==0)
	{
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
		GPIO_InitStruct.GPIO_Mode=GPIO_Mode_IPU;		//复用推挽输出	
//		GPIO_InitStruct.GPIO_Speed=GPIO_Speed_50MHz;
		
		switch(TIM_channel)
		{
			case 1:	GPIO_InitStruct.GPIO_Pin=GPIO_Pin_0;
					GPIO_Init(GPIOA,&GPIO_InitStruct);
					GPIO_ResetBits(GPIOA,GPIO_Pin_0);//PA0 上拉
					break;
			case 2:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_1;
					GPIO_Init(GPIOA,&GPIO_InitStruct);
					GPIO_ResetBits(GPIOA,GPIO_Pin_1);//PA1 上拉				
					break;
			case 3:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_2;
					GPIO_Init(GPIOA,&GPIO_InitStruct);
					GPIO_ResetBits(GPIOA,GPIO_Pin_2);//PA2 上拉
					break;
			case 4:GPIO_InitStruct.GPIO_Pin=GPIO_Pin_3;
					GPIO_Init(GPIOA,&GPIO_InitStruct);
					GPIO_ResetBits(GPIOA,GPIO_Pin_3);//PA3 上拉			
			break;	
		}
	}

