CsBoBoNice/STM32F10X_CsBoBo_Lib/CsBoBo_STM32F10X_catch.c
}

void TIM_CATCH_Gpio_init(u8 TIMx,u16 TIM_channel,u8 remap_pwm)
{
	switch(TIMx)
	{
		case 2:TIM2_CATCH_GPIO_Init(TIM_channel,remap_pwm);break;
		case 3:TIM3_CATCH_GPIO_Init(TIM_channel,remap_pwm);break;
		case 4:TIM4_CATCH_GPIO_Init(TIM_channel,remap_pwm);break;
		case 5:TIM5_CATCH_GPIO_Init(TIM_channel,remap_pwm);break;		
	}
}
TIM_TypeDef* get_CATCH_num(u8 TIMx)
{
	switch(TIMx)
	{
		case 2:return TIM2;
		case 3:return TIM3;
		case 4:return TIM4;
		case 5:return TIM5;		
	}
	return 0;
}


void TIM_Catch_Init(u8 TIMx,u16 TIM_channel,u8 remap_pwm,uint8_t PreemptionPriority,uint8_t SubPriority)
{
	TIM_TypeDef* TIM;
    uint16_t channel;
	NVIC_InitTypeDef NVIC_InitStructure;
    TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;	
	TIM_ICInitTypeDef  TIM_ICInitStructure;
	TIM=get_CATCH_num(TIMx);
	TIM_CATCH_Gpio_init(TIMx,TIM_channel,remap_pwm);


	
	    //这个就是自动装载的计数值，由于计数是从0开始的，计数10000次后为9999
    TIM_TimeBaseStructure.TIM_Period =65535;
    // 这个就是预分频系数，当由于为0时表示不分频所以要减1
    TIM_TimeBaseStructure.TIM_Prescaler = (72 - 1);
    // 高级应用本次不涉及。定义在定时器时钟(CK_INT)频率与数字滤波器(ETR,TIx)
    // 使用的采样频率之间的分频比例
    TIM_TimeBaseStructure.TIM_ClockDivision =TIM_CKD_DIV1;
    //向上计数
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
    //初始化定时器5
    TIM_TimeBaseInit(TIM, &TIM_TimeBaseStructure);

    /* Clear TIM5 update pending flag[清除TIM5溢出中断标志] */

	switch(TIM_channel)
	{
		case 1:channel=TIM_Channel_1;break;
		case 2:channel=TIM_Channel_2;break;
		case 3:channel=TIM_Channel_3;break;
		case 4:channel=TIM_Channel_4;break;		
	}
		//初始化TIM5输入捕获参数
	TIM_ICInitStructure.TIM_Channel = channel; //CC1S=01 	选择输入端 IC1映射到TI1上
  	TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Falling;	//下升沿捕获
  	TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI; //映射到TI1上
  	TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;	 //配置输入分频,不分频 
  	TIM_ICInitStructure.TIM_ICFilter = 0x00;//IC1F=0000 配置输入滤波器 不滤波
  	TIM_ICInit(TIM, &TIM_ICInitStructure);
    /* TIM5 enable counter */
    TIM_Cmd(TIM, ENABLE);  //计数器使能，开始工作

 
//	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2); 
#ifdef STM32F10X_MD
	switch(TIMx)
    {
        case 2:NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn ;break;
        case 3:NVIC_InitStructure.NVIC_IRQChannel = TIM3_IRQn ;break;
        case 4:NVIC_InitStructure.NVIC_IRQChannel = TIM4_IRQn ;break;     
    }
#endif /* STM32F10X_MD */
	
#ifdef STM32F10X_HD
	switch(TIMx)
    {
        case 2:NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn ;break;
        case 3:NVIC_InitStructure.NVIC_IRQChannel = TIM3_IRQn ;break;
        case 4:NVIC_InitStructure.NVIC_IRQChannel = TIM4_IRQn ;break;
        case 5:NVIC_InitStructure.NVIC_IRQChannel = TIM5_IRQn ;break;      
    }
#endif /* STM32F10X_HD */

#ifdef STM32F10X_CL
	switch(TIMx)
    {
        case 2:NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn ;break;
        case 3:NVIC_InitStructure.NVIC_IRQChannel = TIM3_IRQn ;break;
        case 4:NVIC_InitStructure.NVIC_IRQChannel = TIM4_IRQn ;break;
        case 5:NVIC_InitStructure.NVIC_IRQChannel = TIM5_IRQn ;break;      
    }
#endif /* STM32F10X_CL */
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = PreemptionPriority;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = SubPriority; 
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE; 
	NVIC_Init(&NVIC_InitStructure);
	switch(TIM_channel)
	{
		case 1:	TIM_ITConfig(TIM,TIM_IT_Update|TIM_IT_CC1,ENABLE);//允许更新中断 ,允许CC1IE捕获中断
				break;
		case 2:	TIM_ITConfig(TIM,TIM_IT_Update|TIM_IT_CC2,ENABLE);//允许更新中断 ,允许CC1IE捕获中断
				break;
		case 3:	TIM_ITConfig(TIM,TIM_IT_Update|TIM_IT_CC3,ENABLE);//允许更新中断 ,允许CC1IE捕获中断
				break;
		case 4:	TIM_ITConfig(TIM,TIM_IT_Update|TIM_IT_CC4,ENABLE);//允许更新中断 ,允许CC1IE捕获中断
				break;		
	}
//	TIM_ITConfig(TIM,TIM_IT_Update|TIM_IT_CC1|TIM_IT_CC2|TIM_IT_CC3|TIM_IT_CC4,ENABLE);//允许更新中断 ,允许CC1IE捕获中断
	
}
/*
  * log:

  *	2016年7月12日
	新建工程
	实现基本初始化功能
	Programmer:陈述
	
*/

